Repository: AndreasSko/ios-jwlm
Catalog: jwlm/*.lproj/Localizable.strings
Languages: fr

# onboarding.1
source: Library Merger allows you to merge two JW-Library backups into one
fr: Library Merger vous permet de fusionner 2 sauvegardes JW-Library en une.

# onboarding.1.trademark
source: (JW Library is a registered trademark of Watch Tower Bible and Tract Society of Pennsylvania.)
fr: (JW Library est une marque déposé de Watch Tower Bible and Tract Society of Pennsylvania.)

# onboarding.2.first
source: Select both backups
fr: Selectionner les 2 sauvegardes.

# onboarding.2.proTip.first
source: Use AirDrop to send backups between  devices
fr: Utiliser AirDrop pour envoyer une sauvegarde entre 2 appareils.

# onboarding.2.proTip.second
source: The share function allows you to send backups from your local library directly to Library Merger
fr: La fonction de partage vous permet d'envoyer une sauvegarde depuis vos fichiers locaux directement dans Library Merger.

# onboarding.2.proTip.third
source: You can also use iCloud, Dropbox, etc. to import backups from other devices
fr: Vous pouvez également utiliser iCloud, Dropbox, etc. pour importer vos sauvegardes depuis d'autres appareils.

# onboarding.3.first
source: Decide if conflicts should be solved automatically
fr: Décider si le conflit doit être résolu automatiquement.

# onboarding.3.second
source: You can learn more about that later and skip it for now.
fr: Vous pouvez en savoir plus à ce sujet plus tard et l'ignorer pour l'instant

# onboarding.3.third
source: ..and start merging be pressing
fr: ...et démarrer la fusion en pressant.

# onboarding.4.first
source: Library Merger checks for conflicting entries
fr: Library Merger vérifie les entrées confictuelles.

# onboarding.4.second
source: If a conflict happens, simply select the side that should be included.
fr: En cas de conflit, sélectionner simplement la partie que vous voulez inclure.

# onboarding.4.third
source: The first time, there might be a lot of conflicts. But don’t worry: All further ones should be pretty quick.
fr: La première fois, il pourrait y avoir beaucoup de conflits. Mais ne vous inquiétez pas tous les autres devraient être assez rapide.

# onboarding.4.fourth
source: When everything is finished, you can export the merged backup.
fr: Quand tout est fini, vous pouvez exporté la sauvegarde fusioné.

# onboarding.5.first
source: Ready?
fr: Prêt ?

# onboarding.5.second
source: This app is still in its early stages, so it's always good to keep a backup of your JW Libraries - just in case. If you found a bug or have suggestions, feel free to contact me 😊 The easiest is to open an issue on GitHub or write me an email: jwlm@andreas-sk.de
fr: This app is still in its early stages, so it's always good to keep a backup of your JW Libraries - just in case. Si vous trouvez un bug ou avez une suggestions, sentez vous libre de me contacter 😊 La façon la plus simple est d'ouvrir une issue sur GitHub ou m'écrire un mail : jwlm@andreas-sk.de.

# onboarding.5.third
source: This app is open source.
fr: Cette application est open source.

# onboarding.5.startButton
source: Let's start merging!
fr: Démarrons le fusionnement !

# help.conflictAutoresolution.title
source: What is Conflict Autoresolution?
fr: Qu'est-ce que la résolution automatique de conflit ?

# help.conflictAutoresolution.text
source: When you are merging your backups, it might happen that two entries collide. Instead of asking you how to continue, you can decide to always choose one side instead of the other one. For Notes it's also possible to always choose the newer one. This might come in handy, if you are SURE that one side is always the one to include. The safest path - especially when merging for the first time - is to leave it at `manual` and decide for each case, which entry should be included into the final backup.
fr: Quand vous fusioner vos sauvegardes, il peut arrivé que deux entrées entre en conflit. Avant de vous dire de continuer, vous pouvez décider de toujours choisir une entrée au lieu d'une autre. Pour les notes il est également possible de toujours choisir l'entrée la plus récente. Cela pourrait être utile si vous êtes sûr que cette entrée est toujours celle à inclure. Le moyen le plus simple - surtout lors du premier fusionnage - est de le laisser sur `manuel` et de décider pour chaque cas quelle entrée inclure pour la sauvegarde finale.

# help.conflict.bookmarks.title
source: Bookmark conflict
fr: Conflit de signet

# help.conflict.bookmarks.text
source: Bookmarks are set for each publication (i.e. a Watchtower issue or a Bible translation) and can be placed at ten different „slots“ (the colors you see in the app). A collision happens, if two bookmarks are placed at the same slot for the same publication. Choose the bookmark that should be included in the merged backup. The upper one belongs to the right backup, the lower one to the left. To figure out, to which publication this Bookmark belongs to, look at the additional information: „BookNumber“ and „ChapterNumber“ generally relate to a Bible book, while „DocumentID“ might be a Watchtower issue or a different publication.
fr: Des signets sont définis pour chaque publication (ex : une question de Tour de Garde ou une traduction de la Bible) et peut-être placé à dix „emplacements“ différent (les couleurs que vous voyer dans l'application). Un conflit survient si deux signet sont placé au même endroit, sur la même publication. Choissisez le signet que vous voulez inclure dans la sauvegarde fusioné. Celui du haut appartient à la sauvegarde de droite, celui du bas, à celle de gauche. Pour savoir où se trouve le signet, regardez les informations supplémentaires : „Numéro du livre“ et „Chapitre du livre“ se rapportent généralement à un livre de la Bible, tandis que „Identifiant de document“ peut être un numéro de Tour de Garde ou une publication différente.

# help.conflict.markings.title
source: Marking conflict
fr: Conflit de soulignement

# help.conflict.markings.text
source: Markings conflict if they overlap at at least one point. A marking is defined by a Identifier, a StartToken and EndToken. You can think of identifier as paragraphs in a extended way: In bible books thery generally correlate to the verses, however in other publications, questions and captions are also counted towards identifiers. Start- and Endtoken represent the beginning and the end of a marking, where words and punctuation marks are counted as tokens (e.g. the sentence “You are my witnesses,” contains five tokens, as four words and one comma are counted). Note that a marking can span multiple Paragraphs. Choose the marking that should be included in the merged backup. The upper one belongs to the right backup, the lower one to the left. To figure out where the marking is located, look at the additional information: „BookNumber“ and „ChapterNumber“ generally relate to a Bible book, while „DocumentID“ might be a Watchtower issue or a different publication.
fr: Un soulignement de conflit survient s'ils se chevauchent au moins en un point. Un soulignement est défini par un Identifiant, un token de début et un token de fin. Vous pouvez considérer l'identifiant comme des paragraphes de manière étendue: Dans les livres bibliques, ils correspondent généralement aux versets, cependant dans d'autres publications, les questions et les légendes sont également comptabilisées dans les identifiants. Le token de début et de fin représentent le début et la fin d'un soulignement, où les mots et les signes de ponctuations sont contabilisés comme un token (ex : la phrase “Vous êtes mes disciples,” contient cinq token, 4 mots et une virgule sont comptés). Notez qu'un soulignement peut s'étendre sur plusieurs paragraphes. Choisisez le soulignement que vous voulez inclure dans la sauvegarde fusioné. Celui du haut appartient à la sauvegarde de droite, celui du bas, à celle de gauche. Pour savoir où se trouve le soulignement, regardez les informations supplémentaires : „Numéro du livre“ et „Chapitre du livre“ se rapportent généralement à un livre de la Bible, tandis que „Identifiant de document“ peut être un numéro de Tour de Garde ou une publication différente.

# help.conflict.notes.title
source: Note conflict
fr: Conflit de note

# help.conflict.notes.text
source: A note collides if it exists on both sides (so it must have been synced at least once) and it differers in the title or content. It generally makes sense to choose the note with the newest date. The upper one belongs to the right backup, the lower one to the left.
fr: Un conflit de note survient si elle existe dans les deux entrées (elle doit donc avoir été synchronisé au moins une fois) et doit différé dans le titre et le contenu. Il est généralement judicieux de choisir la note avec la date la plus récente. Celle du haut appartient à la sauvegarde de droite, celle du bas, à celle de gauche

# help.conflict.input fields.title
source: Input field conflict
fr: Conflit de champ de saisie

# help.conflict.input fields.text
source: Input fields are used in interactive publications where you can enter custom notes, tick boxes, etc. An example would be the 'Enjoy Life Forever!' brochure.
fr: Les champs de saisie sont utilisé dans les publications interactives où vous pouvez entrer des notes personnalisées, case à cocher, etc. Un exemple serait la brochure 'Vivez pour toujours !'

# settings.catalogDB.quickInfo
source: Download the Publication Catalog to see more detailed information when merging.
fr: Télécharger le catalogue des publications pour voir des informations plus détaillés lors du fusionnement.

# settings.catalogDB.downloadSize
source: Downloading the catalog takes about 50MB.
fr: Télécharger le catalogue prend environ 50MB.

# settings.catalogDB.explainer
source: It's a database that contains information about all the publications of the last years. With its help you are able to get more detailed information (like the title of a publication) when solving a merge conflicts. But you can also use the app without downloading it.
fr: C'est une base de données qui contient les informations à propos de toutes les publications de ces dernières années. Grâce à cela, vous pouvez obtenir des informations plus détaillées (comme le titre d'une publication) lors de la résolution d'un conflit de fusion. Mais vous pouvez également utiliser l'app sans le télécharger

# settings.catalogDB.disclaimer
source: The catalog is downloaded from app.jw-cdn.org, which is operated by Watchtower Bible and Tract Society of New York, Inc. You may want to consider their Privacy Policy if you are not sure what data might be processed when you initialize the download.
fr: Le catalogue est télécharger depuis app.jw-cdn.org, qui appartient à Watchtower Bible and Tract Society of New York, Inc. Vous voudrez peut-être consulter leur politique de confidentialité si vous n'êtes pas sûr des données susceptibles d'être traitées lorsque vous commencé le téléchargement.

# settings.sentry.explanation
source: You can enable to automatically send a bug report to me, the developer of the Library Merger, in case you encounter an issue. This helps to surface problems that others might face as well. For this, a third-party service called "Sentry.io" is used. The data collected does not contain personally identifiable information, but rather information like your operating system and the error message you received. None of your backups will be sent, however an error report might contain snippets like a marking or a note that was processed when you encountered the bug. The data is only used to improve the app. The automatic report is disabled by default. If you feel confident sharing a bug report with me, you can enable it with the following toggle.
fr: Vous pouvez activer pour envoyer automatiquement un rapport de bug à moi, le développeur de Library Merger, dans le cas cas où vous rencontrez un problème. Cela aide à faire ressortir les problèmes auxquels d'autres pourraient également être confrontés. Pour cela, un service tiers appelé "Sentry.io" est utilisé. Les données collectés ne contiennent pas d'information personnel, mais plutôt des informations comme votre système d'exploitation et le message d'erreur que vous recevez. Aucune de vos sauvegardes ne sera envoyé, cependant, un rapport d'erreur peut contenir des extraits comme un marquage ou une note qui a été traité lorsque vous avez rencontré le bug. Les données sont seulement utilisé pour amélioré l'application. Le rapport automatique est désactivé par défaut. Si vous vous sentez confiant de partager un rapport de bug avec moi, vous pouvez l'activer avec la bascule suivante.

# errorView.reportError
source: Looks like you found a bug 😅. Could you help me to fix it? I would really appreciate it if you could send me a bug report with the error below at jwlm@andreas-sk.de. Usually, it's beneficial for me to have a look at the actual backups you tried to merge. So if you feel confident with it, please feel free to provide them with the bug report - of course, I'm only looking at the specific issue and leave the rest of the data untouched. Thank you so much for your help! 😊
fr: Il se pourrait que vous avez trouvé un bug 😅. Vous pouvez m'aider à le corrigé ? J'apprécirais vraiment si vous vous pouvez m'envoyer un raport de bug avec l'erreur à : jwlm@andreas-sk.de. Généralement, il est plus facile pour moi de jeter un œil aux sauvegardes que vous avez essayé de fusionner. Donc, si vous vous sentez en confiance, n'hésitez pas à me fournir le rapport de bug - bien sûr, je ne regarde que le problème spécifique et laisse le reste des données intact. Merci beaucoup pour votre aide ! 😊

# errorView.sentryHint
source: You can also decide to automatically send error reports:
fr: Vous pouvez également décider d'envoyer automatiquement des rapports d'erreurs :
